/* ======================================== */
/*    程式实例: 2_6_1b.c                    */
/*    计算出一星期的课程总数.(以行为主)     */
/* ======================================== */

/*
ROW        - 行
COLUMN - 列+9
以下示例中执行列扫描

[j*ROW+i]
j        - 行索引
ROW - 列数
i        - 列索引

*/

#define ROW    6                       /* 定义列数         */
#define COLUMN 5                       /* 定义行数         */

int main()
{
   int class[30] = { 0, 1, 5, 0, 3, 0, /* 课程定义         */
                     2, 4, 0, 0, 0, 0,
                     0, 1, 5, 0, 3, 0,
                     2, 4, 0, 0, 0, 0,
                     0, 1, 5, 0, 3, 0 };
   int sum;                            /* 课程总数         */
   int i,j;

   sum = 0;                            /* 设定课程总数初值 */
   for ( i = 0; i < 6; i++ )           /* 阵列的走访       */
      for ( j = 0; j < 5; j++ )
         if ( class[j*ROW+i] != 0 )    /* 检查有没有课     */
            sum++;

   printf("课程总数: %d\n",sum);       /* 印出课程总数     */

   return 0;
}
