/* ======================================== */
/*    程式实例: 2_9_5.c                    */
/*    字串删除                              */
/* ======================================== */

/* ---------------------------------------- */
/*  字串删除                                */
/* ---------------------------------------- */
char *strdel(char *str,int pos,int len)
{
   int i;

   pos --;                        /* 计算字串的开始 */
  /* 从pos开始删除长度len的字串 */
   for ( i = pos + len; str[i] != '\0'; i++ )
      str[i-len] = str[i];
   str[i-len] = '\0';             /* 新的字串结束   */
   return str;
}

/* ---------------------------------------- */
/*  主程式                                  */
/* ---------------------------------------- */
int main()
{
   char string[200];              /* 字串阵列宣告 */
   int pos;                       /* 删除位置     */
   int len;                       /* 删除长度     */
                                                  
   printf("请输入原始字符串 ==> ");
   gets(string);                  /* 读取字串     */
   printf("请输入删除位置 ==> ");
   scanf("%d",&pos);              /* 读取位置     */
   printf("请输入删除长度 ==> ");
   scanf("%d",&len);              /* 读取长度     */
   strdel(string,pos,len);        /* 删除字串     */
   printf("删除后的字符串是 %s \n ",string);

   return 0;
}
