/* ======================================== */
/*    程序实例: 1_1a.c                      */
/*    计算总分和平均分                        */
/* ======================================== */

int main()
{
   int t1,t2,t3,t4,t5;                 /*各科的成绩 */
   int t6,t7,t8,t9,t10;
   int sum;                            /* 总分       */
   int average;                        /* 平均分       */

   t1 = 81; t2 = 93; t3 = 77; t4 = 59; t5 = 69;
   t6 = 85; t7 = 90; t8 = 83; t9 = 100; t10 = 75;
   sum = t1 + t2 + t3 + t4 +
         t5 + t6 + t7 + t8 + t9 + t10; /* 计算总分   */
   average = sum / 10;                 /* 计算平均分  */
   printf("输出总分:%d\n",sum);        /* 输出总分   */
   printf("输出平均:%d\n",average);    /* 输出平均分   */

   return 0;
}
