/* ======================================== */
/*    程式实例: 2_6_2a.c                    */
/*    计算出一星期的课程总数.(指标阵列)     */
/* ======================================== */

int main()
{
   int pointer[6] = { 0, 10, 5, 25, 15, 20 }; // 行开头元素一元索引

   int data[30] = { 0, 2, 0, 2, 0,     /* 课程定义         */
                    5, 0, 5, 0, 5,
                    1, 4, 1, 4, 1,

                    3, 0, 3, 0, 3,
                    0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0 };
   int sum;                            /* 课程总数         */
   int i,j;

   sum = 0;                            /* 设定课程总数初值 */
   for ( i = 0; i < 6; i++ )           /* 阵列的走访       */
      for ( j = 0; j < 5; j++ )
         if ( data[pointer[i]+j] != 0 )  /* 检查有没有课   */
            sum++;
   printf("课程总数: %d\n",sum);       /* 印出课程总数     */

   return 0;
}
