/* ======================================== */
/*    程式实例: 2_9.c                     */
/*    计算字串长度                          */
/* ======================================== */

/* ---------------------------------------- */
/*  计算字串长度                            */
/* ---------------------------------------- */
int strlen(char *str)
{
   int i;

   for ( i = 0; str[i] != '\0'; i++ ); /* 用回路计算长度 */
   return i;
}

/* ---------------------------------------- */
/*  主程式: 读入字串後, 印出字串长度        */
/* ---------------------------------------- */
int main()
{
   char string[100];                   /* 字串阵列宣告   */
   int len;                            /* 字串长度       */

   printf("请输入字符串 ==> ");
   gets(string);                       /* 读取字串       */
   len = strlen(string);               /* 计算字串长度   */
   printf("输入字符串长度是 %d \n ",len);

   return 0;
}