/* ======================================== */
/*    程序实例: 2_4a.c                     */
/*    用学生成绩来查询学号                  */
/* ======================================== */

int main()
{
   int score[10] = { 76, 85, 90, 67, 59, 79, 82,
                     95, 91, 65 }; /* 学生成绩数组 */
   int num;                        /* 学生学号变量 */
   int grade;                      /* 学生成绩变量 */
   int i;

   num = -1;                       /* 设置学号初值 */
   printf("请输入学生成绩( 0 到 100). ==> ");
   scanf("%d",&grade);             /* 读取成绩     */
   for ( i = 0; i < 10; i++ )      /* 遍历成绩阵列 */
      if ( score[i] == grade )     /* 找到此成绩   */
      {
         num = i;                  /* 存入学号变量 */
         break;                    /* 结束遍历     */
      }

   if ( num != -1 )                /* 是否有此成绩 */
      printf("学生学号是: %d\n ",num); /* 输出学号 */
   else
      printf("没有此成绩的学生\n ");

   return 0;
}