/* ======================================== */
/*    程式实例: 2_9_2.c                     */
/*    结合两字串                            */
/* ======================================== */

/* ---------------------------------------- */
/*  结合两字串                              */
/* ---------------------------------------- */
char *strcat(char *str1,char *str2)
{
   int i,j;

   for ( i = 0; str1[i] != '\0'; i++); /* 找字串str1结束 */
   for ( j = 0; str2[j] != '\0'; j++)  /* 拷贝字串内容   */
      str1[i+j] = str2[j];

   str1[i+j] = '\0';                   /* 设定字串结束   */

   return str1;
}

/* ---------------------------------------- */
/*  主程式: 输入二字串後, 将之结合成一字串. */
/* ---------------------------------------- */
int main()
{
   char string1[200];                  /* 字串阵列1宣告 */
   char string2[100];                  /* 字串阵列2宣告 */

   printf("请输入字符串(1) ==> ");
   gets(string1);                      /* 读取字串1     */
   printf("请输入字符串(2) ==> ");
   gets(string2);                      /* 读取字串2     */
   strcat(string1,string2);            /* 字串结合      */
   printf("合并后的字符串是 %s \n ",string1);

   return 0;
}
