/* ======================================== */
/*    程式实例: 9_2.c                       */
/*    列出费氏数组                          */
/* ======================================== */

void main()
{
   int n;                         /* 项数变数       */
   int fn;                        /* F(n)变数       */
   int fn2;                       /* F(n-2)变数     */
   int fn1;                       /* F(n-1)变数     */
   int i;

   printf("请输入数列项数 ==> ");
   scanf("%d",&n);                /* 读入项数       */
   if ( n <= 1 )                  /* 项数是否小於1  */
      printf("[%d]\n",n);         /* 印出数组       */
   else
   {
      fn2 = 0;                    /* 设定 F(n-2)    */
      fn1 = 1;                    /* 设定 F(n-1)    */
      printf("[0][1]");           /* 印出数组前二项 */
      for ( i = 2; i <= n; i++ )  /* 印出数组回路   */
      {
         fn = fn2 + fn1;          /* 一般项         */
         printf("[%d]",fn);       /* 印出数组       */
         fn2 = fn1;               /* 重设 F(n-2)    */
         fn1 = fn;                /* 重设 F(n-1)    */
      }
      printf("\n");               /* 换行           */
   }
}
