/* ======================================== */
/*    程序实例: 10_4.c                      */
/*    插入排序法                            */
/* ======================================== */
#include <stdlib.h>
#define MAX  20                   /* 最大字符串长度          */

/* ---------------------------------------- */
/*  插入排序法                              */
/* ---------------------------------------- */
void insert(char *string,int count)
{
   int i,j;
   char temp;

   for ( i = 1; i < count; i++ )  /* 第一层循环            */
   {
      temp = string[i];           /* 建立初值              */
      j = i - 1;                  /* 开始位置              */
      /* 空出插入位置 */
      while ( j >= 0 && temp < string[j] )
      {
         string[j+1] = string[j];
         j--;
      }
      string[j+1] = temp;         /* 插入字符              */
      printf("输出结果: [%s]\n",string); /* 输出交换后字符串 */
   }
}

/* ---------------------------------------- */
/*  主程序: 输入字符串后将字符串排序           */
/* ---------------------------------------- */
void main()
{
   char string[MAX];              /* 字符串数组              */
   int count;                     /* 字符串长度              */

   printf("输入要排序的字符串 ==> ");
   gets(string);                  /* 读取字符串              */
   count = strlen(string);        /* 计算字符串长度          */
   insert(string,count);          /* 插入排序法            */
   /* 输出排序后字符串 */
   printf("\n输出排序结果: [%s]\n",string);
}
