/* ======================================== */
/*    程序实例: 1_5_3.c                     */
/*    局部和全局变量                        */
/* ======================================== */
int step = 10;                    /* 全局变量声明 */
int count = 5;                    /* 全局变量声明 */

/* ---------------------------------------- */
/*  将变量值加1                            */
/* ---------------------------------------- */
void increment()
{
   int step = 0;                  /* 局部变数声明  */

   step++;                        /* 局部变数加1 */
   count++;                       /* 全局变量加1 */
   printf(" 子程序    %2d      %2d    \n",step, count);
}

/* ---------------------------------------- */
/*  主程式                                  */
/* ---------------------------------------- */
int main()
{
   int count = 0;                 /* 局部变量声明 */

   count++;                       /* 局部变量加1 */
   step++;                        /* 全局变量加1 */
   printf(" 过程名    STEP    COUNT   \n");
   increment();                   /* 子程序调用 */
   printf(" 主程序    %2d      %2d    \n",step, count);

   return 0;
}