/* ======================================== */
/*    程序实例: 10_2a.c                    */
/*    在字符串中查找最大字符                  */
/* ======================================== */
#include <stdio.h>
#define MAX  20                   /* 最大字符串长度           */

/* ---------------------------------------------------------------*/
/*  找最大的字符                                                                         */
/*  冒泡排序的第一遍，把右边小的往左边推 ，将最大数推到最右    */
/* -------------------------------------------------------------- */
void findchar(char *string,int count)
{
   int i;
   char temp;

   for ( i = 0; i < count - 1; i++ )  /* 循环               */
      if ( string[i+1] < string[i] )  /* 比较相邻的数组元素 */
      {
         temp = string[i+1];      /* 交换两字符             */
         string[i+1] = string[i];
         string[i] = temp;
      }
}

/* ---------------------------------------- */
/*  主程序: 输入字符串来找最大字符         */
/* ---------------------------------------- */
int main()
{
   char string[MAX];              /* 字符串数据               */
   int count;                     /* 字符串长度               */

   printf("输入要查找的字符串 ==> ");
   gets(string);                  /* 读取字符串               */
   count = strlen(string);        /* 计算字符串长度           */
   findchar(string,count);        /* 查找                   */
   /* 输出处理后字符串 */
   printf("处理后字符串: [%s]\n",string);
   /* 输出最大的字符 */
   printf("最大的字符是:%c\n",string[count-1]);

   return 0;
}
