/* ======================================== */
/*    程式实例: 6_2_2.c                     */
/*    使用列印数组函数来说明递归调用        */
/* ======================================== */

int list[6] = { 1, 2, 3, 4, 5, 6 }; /* 数组内容     */

/* ---------------------------------------- */
/*  递归数组反向列印函数                    */
/* ---------------------------------------- */
void invert_array(int j)
{
   if ( j < 6 )                     /* 终止条件     */
   {
      /* 递归链表列印函数调用 */
      invert_array(j + 1);
      printf("[%d]",list[j]);       /* 列印元素资料 */
   }
}

/* ---------------------------------------- */
/*  主程式: 反向列印数组内容.               */
/* ---------------------------------------- */
void main()
{
   int i;

   printf("数组的内容:\n");
   for ( i = 0; i < 6; i++ )
      printf("[%d]",list[i]);       /* 列印元素资料 */
   printf("\n");                    /* 换行         */
   printf("递归列印数组的内容:\n");
   invert_array(0);                 /* 调用列印函数 */
   printf("\n");                    /* 换行         */
}
