/* ======================================== */
/*    ³ÌÊ½ÊµÀý: 2_9_6.c                    */
/*    ×Ö´®±È½Ï                              */
/* ======================================== */

/* ---------------------------------------- */
/*  ×Ö´®±È½Ï                                */
/* ---------------------------------------- */
int strcmp(char *str1,char *str2)
{
   int i,j;

   for ( i = 0; str1[i] == str2[i]; i++ )
      /* ×Ö´®1µÈì¶×Ö´®2 */
      if ( str1[i] == '\0' && str2[i] == '\0' )
         return 0;
   if ( str1[i] < str2[i] )       /* ×Ö´®1Ð¡ì¶×Ö´®2 */
      return -1;
   return 1;                      /* ×Ö´®1´óì¶×Ö´®2 */
}

/* ---------------------------------------- */
/*  Ö÷³ÌÊ½: ÊäÈëÁ½×Ö´®, ±È½ÏÆäÄÚÈÝ.         */
/* ---------------------------------------- */
int main()
{
   char string1[100];             /* ×Ö´®ÕóÁÐ1Ðû¸æ  */
   char string2[100];             /* ×Ö´®ÕóÁÐ2Ðû¸æ  */
   int result;                    /* ±È½Ï½á¹û       */

   printf("ÇëÊäÈë×Ö·û´®(1) ==> ");
   gets(string1);                 /* ¶ÁÈ¡×Ö´®1      */
   printf("ÇëÊäÈë×Ö·û´®(2) ==> ");
   gets(string2);                      /* ¶ÁÈ¡×Ö´®2 */
   result = strcmp(string1,string2);   /* ×Ö´®±È½Ï  */
   switch ( result )
   {
      case  0: printf("×Ö·û´®(1)µÈÓÚ×Ö·û´®(2)\n");
               break;
      case  1: printf("×Ö·û´®(1)´óì¶×Ö´®(2)\n");
               break;
      case -1: printf("×Ö·û´®(1)Ð¡ì¶×Ö·û´®(2)\n");
               break;
   }

   return 0;
}
