/* ======================================== */
/*    程式实例: 2_5b.c                     */
/*    计算出一星期的课程总数                */
/* ======================================== */

int main()
{
   int course[6][5] = { 0, 2, 0, 2, 0,   /* 课程定义    */
                        1, 4, 1, 4, 1,
                        5, 0, 5, 0, 5,
                        0, 0, 0, 0, 0,
                        3, 0, 3, 0, 3,
                        0, 0, 0, 0, 0 };
   int sum;                              /* 课程总数    */
   int i,j;

   sum = 0;                         /* 设定课程总数初值 */
   for ( i = 0; i < 6; i++ )        /* 二维阵列的走访   */
      for ( j = 0; j < 5; j++ )
         if ( course[i][j] != 0 )   /* 检查有没有课     */
            sum++;
   printf("课程总数: %d\n",sum);    /* 印出课程总数     */

   return 0;
}
