/* ======================================== */
/*    程式实例: 3_1_2.c                   */
/*    浮点数记忆体配置和释放                */
/* ======================================== */
#include <stdlib.h>

int main()
{
   float *fp;                            /* 浮点指标宣告     */

   fp = (float *) malloc(sizeof(float)); /* 配置浮点数记忆体 */
   if ( !fp )                            /* 检查指标         */
   {
      printf("记忆体配置失败! \n");
      exit(1);
   }

   *fp = 3.1415926;                      /* 设定变数值       */
   printf("圆周率: %10.8f \n",*fp);      /* 列出结果         */
   free(fp);                             /* 释回记忆体空间   */

   return 0;
}
