/* ======================================== */
/*    程式实例: 2_9_3.c                     */
/*    从某位置取代字串                      */
/* ======================================== */

/* ---------------------------------------- */
/*  取代字串                                */
/* ---------------------------------------- */
char *strrep(char *str1,char *str2,int pos)
{
   int i,j;

   pos --;                        /* 计算字串的开始      */
   i = 0;
   for ( j = pos; str1[j] != '\0'; j++ ) /* 走访字串str1 */
      if ( str2[i] != '\0' )
      {
         str1[j] = str2[i];       /* 取代str2至str1      */
         i++;
      }
      else
         break;
   return str1;
}

/* ---------------------------------------- */
/*  主程式: 在字串str1内取代字串str2.       */
/* ---------------------------------------- */
int main()
{
   char string1[200];             /* 字串阵列1宣告 */
   char string2[100];             /* 字串阵列2宣告 */
   int pos;                       /* 取代位置      */

   printf("请输入原始字符串 ==> ");
   gets(string1);                 /* 读取字串1     */
   printf("请输入取代字符串 ==> ");
   gets(string2);                 /* 读取字串2     */
   printf("请输入取代位置 ==> ");
   scanf("%d",&pos);              /* 读取位置      */
   strrep(string1,string2,pos);   /* 取代字串      */
   printf("取代后的字符串是 %s \n ",string1);

   return 0;
}
