/* ======================================== */
/*    程式实例:5_1a.c                       */
/*    使用数组来构建栈                    */
/* ======================================== */
#include <stdlib.h>
#include <time.h>
#define MAXSTACK 100              /* 最大栈容量   */

int stack[MAXSTACK];              /* 栈的数组宣告 */
int top = -1;                     /* 栈的顶端     */

/* ---------------------------------------- */
/*  栈资料的存入                          */
/* ---------------------------------------- */
int push(int value)
{
   if ( top >= MAXSTACK )         /* 是否超过容量   */
   {
      printf("栈内容全满\n");
      return -1;                  /* 存入失败       */
   }
   top++;                         /* 栈指标加一   */
   stack[top] = value;            /* 存入栈       */
}

/* ---------------------------------------- */
/*  栈资料的取出                          */
/* ---------------------------------------- */
int pop()
{
   int temp;

   if ( top < 0 )                 /* 是否栈是空   */
   {
      printf("栈内容是空的\n");
      return -1;                  /* 取出失败       */
   }
   temp = stack[top];             /* 取出资料       */
   top--;                         /* 栈指标减一   */
   return temp;                   /* 栈取出       */
}

/* ---------------------------------------- */
/*  主程式: 洗牌后, 将牌发给四个人.         */
/*     红心: 数组  0 - 12                   */
/*     方块: 数组 13 - 25                   */
/*     梅花: 数组 26 - 38                   */
/*     黑桃: 数组 39 - 51                   */
/* ---------------------------------------- */
void main()
{
   int card[52];                  /* 朴克牌数组     */
   int pos;                       /* 牌代码         */
   int i,temp;
   long temptime;
   srand(time(&temptime) % 60);   /* 使用时间初始乱数 */
   for ( i = 0; i < 52; i++ )
      card[i] = 0;                /* 清除朴克牌数组 */
   i = 0;
   while ( i != 52 )              /* 洗牌回路       */
   {
      pos = rand() % 52;          /* 乱数取值0-51   */
      if ( card[pos] == 0 )       /* 是否是未洗牌   */
      {
         push(pos);               /* 存此张牌进栈 */
         card[pos] = 1;           /* 设定此张牌洗过 */
         i++;                     /* 下一张牌       */
      }
   }
   printf("    1      2      3      4 \n");
   printf(" ==========================\n");
   for ( i = 0; i < 5; i++ )    /* 发牌给四人的回路 */
   {
      temp = pop();               /* 取出栈资料   */
      printf(" [%c%2d] ",temp / 13 + 3,temp % 13 + 1);
      temp = pop();               /* 取出栈资料   */
      printf(" [%c%2d] ",temp / 13 + 3,temp % 13 + 1);
      temp = pop();               /* 取出栈资料   */
      printf(" [%c%2d] ",temp / 13 + 3,temp % 13 + 1);
      temp = pop();               /* 取出栈资料   */
      printf(" [%c%2d] ",temp / 13 + 3,temp % 13 + 1);
      printf("\n");               /* 换行           */
   }
}
